In [1]:
import pandas as pd
import numpy as np

In [2]:
import pyodbc
conn=pyodbc.connect('Driver={SQL Server};'
                     "Server=JISHNU\GATTU;"
                     "Database=test1;"
                     "Trusted_Connection=yes;")


###  Problem 1:Find the total number of crimes recorded in the CRIME table

In [3]:
crime1=pd.read_sql_query('select count(*)from chicagocrime',conn)
crime1

0  533


### Problem 2: List community areas with per capita income less than 11000.

In [4]:
comu=pd.read_sql_query('select COMMUNITY_AREA_NAME,PER_CAPITA_INCOME from socioeco where PER_CAPITA_INCOME<11000',conn)
comu

  COMMUNITY_AREA_NAME  PER_CAPITA_INCOME
0  West Garfield Park              10934
1      South Lawndale              10402
2         Fuller Park              10432
3           Riverdale               8201

### Problem 3: List all case numbers for crimes  involving minors?(children are not considered minors for the purposes of crime analysis)

In [5]:
crime=pd.read_sql_query('select *from chicagocrime',conn)

In [6]:
ds=crime.loc[crime['DESCRIPTION'].str.contains('MINOR') ]
ds[['CASE_NUMBER']]

    CASE_NUMBER
514    HL266884
515    HK238408

### Problem 4: List all kidnapping crimes involving a child?

In [7]:
crime.loc[(crime['DESCRIPTION'].str.contains('CHILD')) & (crime['PRIMARY_TYPE'].str.contains('KIDNAP'))]

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,UPDATEDON,LATITUDE,LONGITUDE,LOCATION
520,5276766,HN144152,2007-01-26 10:05:00.0000000,050XX W VAN BUREN ST,1792,KIDNAPPING,CHILD ABDUCTION/STRANGER,STREET,False,False,...,29.0,25.0,20,1143050.0,1897546.0,2007,2018-02-28 15:56:25.0000000,41.874908,-87.750252,"(41.874908413, -87.750249307)"

## Problem 5: What kind of crimes were recorded at schools?

In [8]:
dr=crime.loc[crime['LOCATION_DESCRIPTION'].str.contains('SCHOOL')]
dr[['PRIMARY_TYPE']]

               PRIMARY_TYPE
118                 BATTERY
121                 BATTERY
141                 BATTERY
166                 BATTERY
183                 BATTERY
220         CRIMINAL DAMAGE
263               NARCOTICS
265               NARCOTICS
364                 ASSAULT
471       CRIMINAL TRESPASS
498  PUBLIC PEACE VIOLATION
499  PUBLIC PEACE VIOLATION

## Problem 6: List the average safety score for all types of schools.

In [9]:
ca=pd.read_sql_query("select*from publicschoolchicago",conn)

In [10]:
cs=ca[['Elementary_Middle_or_High_School','SAFETY_SCORE']]
c2= cs.groupby(['Elementary_Middle_or_High_School']).mean()
c2

                                  SAFETY_SCORE
Elementary_Middle_or_High_School
ES                                   49.520384
HS                                   49.623529
MS                                   48.000000

## Problem 7: List 5 community areas with highest % of households below poverty line

In [11]:
s=pd.read_sql_query('select*from socioeco',conn)

In [12]:
sc=s.sort_values('PERCENT_HOUSEHOLDS_BELOW_POVERTY',ascending=False)
a=sc[['COMMUNITY_AREA_NAME','PERCENT_HOUSEHOLDS_BELOW_POVERTY']]
a.head(5)

   COMMUNITY_AREA_NAME  PERCENT_HOUSEHOLDS_BELOW_POVERTY
53           Riverdale                         56.500000
36         Fuller Park                         51.200001
67           Englewood                         46.599998
28      North Lawndale                         43.099998
26  East Garfield Park                         42.400002

## Problem 8: Which community area(number) is most crime prone?

In [13]:
x=crime['COMMUNITY_AREA_NUMBER'].value_counts()
x.head(3)

25.0    43
23.0    22
68.0    21
Name: COMMUNITY_AREA_NUMBER, dtype: int64

## Problem 9: Use a sub-query to find the name of the community area with highest hardship index.

In [14]:
y=s.sort_values('HARDSHIP_INDEX',ascending=False)
y['COMMUNITY_AREA_NAME'].head(1)

53    Riverdale
Name: COMMUNITY_AREA_NAME, dtype: object

## Problem 10: Use a sub-query to determine the Community Area Name with most number of crimes?

#### As we know from resent chicago_crime data the most most number of cases are recorded in COMMUNITY_AREA_NUMBER 25(prob.8)

In [15]:
sch=pd.read_sql_query('select COMMUNITY_AREA_NAME from socioeco where COMMUNITY_AREA_NUMBER=25',conn)
sch

  COMMUNITY_AREA_NAME
0              Austin